{
  "md-intro-modal": "<p>Maintaining open source projects is <a href=\"https://nolanlawson.com/2017/03/05/what-it-feels-like-to-be-an-open-source-maintainer/\" target=\"_blank\">hard work</a>. As NG-ALAIN&#39;s user base has grown, we are getting more and more usage questions, bug reports, feature requests and pull requests every single day.</p>\n<p>As a free and open source project, NG-ALAIN also has limited maintainer bandwidth. That means the only way to ensure the project&#39;s sustainability is to:</p>\n<ol>\n<li>Prioritize more concrete work (bug fixes and new features);</li>\n<li>Improve issue triaging efficiency.</li>\n</ol>\n<p>For (1), we have decided to use the GitHub issue lists exclusively for work that has well-defined, actionable goals. Questions and open ended discussions should be posted to mediums that are better suited for them.</p>\n<p>For (2), we have found that issues that do not provide proper information upfront usually results in terribly inefficient back-and-forth communication just to extract the basic information needed for actual triaging. This is exactly why we have created this app: to ensure that every issue is created with the necessary information, and to save time on both sides.</p>\n",
  "md-intro": "<h2 id=\"before-you-start\">Before You Start...</h2>\n<p>The issue list is reserved exclusively for bug reports and feature requests. That means we do not accept usage questions. If you open an issue that does not conform to the requirements, <strong>it will be closed immediately</strong>. <a href=\"#intro-modal\">Why are we so strict about this?</a></p>\n<p>For usage questions, please use the following resources:</p>\n<ul>\n<li>Read the <a href=\"https://ng-alain.com\" target=\"_blank\">docs</a></li>\n<li>Look for / ask questions on <a href=\"https://stackoverflow.com/questions/ask?tags=ng-alain\" target=\"_blank\">StackOverflow</a> or <a href=\"https://github.com/ng-alain/ng-alain/issues\" target=\"_blank\">Github</a></li>\n</ul>\n<p>Also try to search for your issue - it may have already been answered or even fixed in the development branch. However, if you find that an old, closed issue still persists in the latest version, you should open a new issue using the form below instead of commenting on the old issue.</p>\n",
  "md-motivation-help": "<p>Explain your use case, context, and rationale behind this feature request. More importantly, what is the <strong>end user experience</strong> you are trying to build that led to the need for this feature?</p>\n<p>An important design goal of NG-ALAIN is keeping the API surface small and straightforward. In general, we only consider adding new features that solve a problem that cannot be easily dealt with using existing APIs (i.e. not just an alternative way of doing things that can already be done). The problem should also be common enough to justify the addition.</p>\n",
  "md-proposal-help": "<p>Describe how you propose to solve the problem and provide code samples of how the API would work once implemented. Note that you can use <a href=\"https://guides.github.com/features/mastering-markdown/\">Markdown</a> to format your code blocks.</p>\n",
  "md-repro-help": "<p>Please provide a link by forking these links <a href=\"https://stackblitz.com/edit/ng-alain-setup\" target=\"_blank\">stackblitz</a> or <a href=\"https://codesandbox.io/s/ng-alain-setup-dd0hq?file=/src/app/app.component.ts\" target=\"_blank\">codesandbox</a>.\n<a href=\"#repro-modal\">What is a minimal reproduction, and why is it required?</a></p>\n",
  "md-repro-modal": "<p>A bug reproduction is a piece of code that can run and demonstrate how a bug can happen.</p>\n<h5 id=\"text-is-not-enough\">Text is not enough</h5>\n<p>It&#39;s impossible to fix a bug from mere text descriptions. First, it&#39;s very difficult to precisely describe a technical problem while keeping it easy to follow; Second, the real cause may very well be something that you forgot to even mention. A reproduction is the only way that can reliably help us understand what is going on, so please provide one.</p>\n<h5 id=\"a-repro-must-be-runnable\">A repro must be runnable</h5>\n<p>Screenshots or videos are <strong>NOT</strong> reproductions! They only show that the bug exists, but do not provide enough information on why it happens. Only runnable code provides the most complete context and allows us to properly debug the scenario. That said, in some cases videos/gifs can help explain interaction issues that are hard to describe in text.</p>\n<h5 id=\"a-repro-should-be-minimal\">A repro should be minimal</h5>\n<p>Some users would give us a link to a real project and hope we can help them figure out what is wrong. We generally do not accept such requests because:</p>\n<ul>\n<li><p>You are already familiar with your codebase, but we are not. It is extremely time-consuming to hunt a bug in a big and unfamiliar codebase.</p>\n</li>\n<li><p>The problematic behavior may very well be caused by your code rather than by a bug in antd.</p>\n</li>\n</ul>\n<p>A <strong>minimal</strong> reproduction means it demonstrates the bug, and the bug only. It should only contain the bare minimum amount of code that can reliably cause the bug. Try your best to get rid of anything that aren&#39;t directly related to the problem.</p>\n<h5 id=\"how-to-create-a-repro\">How to create a repro</h5>\n<p>Unless your bug can only be reproduced with a built setup, we prefer reproductions made with <a href=\"https://stackblitz.com/edit/ng-alain-setup\" target=\"_blank\">stackblitz</a> or <a href=\"https://codesandbox.io/s/ng-alain-setup-dd0hq?file=/src/app/app.component.ts\" target=\"_blank\">codesandbox</a>.</p>\n",
  "md-steps-help": "<p>Clear and concise reproduction instructions are important for us to be\nable to triage your issue in a timely manner. Note that you can use\n<a href=\"https://guides.github.com/features/mastering-markdown/\" target=\"_blank\">Markdown</a>  to format lists and code.</p>\n"
}